[
    {
        "id": "1",
        "title": "ohmyfood",
        "cover": "images/compressed/ohmyfood_1_mobile.webp",
        "description": "Site mobile-first et responsive construit avec Sass",
        "contexte": "OhMyFood, jeune startup déjà implantée à New York, souhaite s’étendre à Paris avec un site permettant de consulter et composer des menus gastronomiques avant l’arrivée au restaurant.\n L’entreprise doit convaincre de nouveaux restaurateurs en proposant une plateforme moderne, rapide et fiable.\n Le projet nécessite de respecter des maquettes fournies par l’UX designer et d’assurer une expérience utilisateur optimale sur mobile, tablette et desktop.",
        "objectifs": [
            "Développer un site mobile-first, totalement responsive, respectant fidèlement les maquettes Figma.",
            "Mettre en place un système de consultation et composition de menus gastronomiques.",
            "Livrer un code clair, organisé, maintenable, avec Sass pour structurer les styles.",
            "Intégrer des animations CSS fluides et cohérentes avec le prototype Figma.",
            "Assurer une performance optimale sur mobile, où se situe le cœur de l’usage."
        ],
        "stack": ["HTML5", "CSS3", "Sass", "Figma", "Mobile-first", "Github"],
        "compétences": [
            "Structurer un projet complet en Sass avec variables, mixins et architecture claire.",
            "Implémenter des animations CSS modernes reproduisant fidèlement un prototype Figma.",
            "Concevoir un site entièrement responsive, adaptable à tous les écrans.",
            "Respect strict d’un brief créatif et de maquettes professionnelles."
        ],
        "résultats": [
            "Un site complet, mobile-first, fonctionnel et fidèle aux maquettes.",
            "Intégration de 4 menus gastronomiques fournis par les restaurateurs partenaires.",
            "Mise en place de pages animées, transitions fluides et interactions conformes au prototype.",
            "Code Sass structuré : variables, mixins, fichier principal compilé.",
            "Respect total du responsive : affichage optimal sur mobile, tablette et desktop."
        ],
        "améliorations": [
            "Intégrer un système dynamique ultérieurement (API menus, gestion des commandes).",
            "Ajouter un dark mode ou des préférences d’affichage.",
            "Améliorer performance, accessibilité et SEO en effectuant un audit complet (Lighthouse, WAVE)."
        ],
        "dépôtGithub": "https://github.com/kev6711/Projet4_ohmyfood.git",
        "githubPages": "https://kev6711.github.io/Projet4_ohmyfood/"
    },
    {
        "id": "2",
        "title": "Sophie Bluel",
        "cover": "images/compressed/sophie_bluel_1_mobile.webp",
        "description": "Portfolio d’architecte d’intérieur : intégration JavaScript et fonctionnalités dynamiques",
        "contexte": "Au sein de l’agence digitale ArchiWebos (50 salariés), le projet consiste à concevoir et développer le site portfolio d’une architecte d’intérieur. Le projet inclut des enjeux de présentation professionnelle, de gestion de contenu par l’administrateur et de cohérence entre design Figma, front-end et back-end.",
        "objectifs": [
            "Développer les nouvelles fonctionnalités front-end nécessaires pour compléter la version statique initiale.",
            "Intégrer une page de présentation des travaux (basée sur du HTML existant).",
            "Mettre en place une page de connexion administrateur (à créer entièrement).",
            "Ajouter une modale d’upload de photos (création de zéro).",
            "Connecter ces fonctionnalités au back-end fourni (gestion des données, login sécurisé, mise à jour dynamique)."
        ],
        "stack": ["HTML5", "CSS3", "Javascript", "API", "Figma", "Github"],
        "compétences": [
            "Intégration d’une maquette Figma dans du code existant.",
            "Implémentation d’un système de login (gestion d’erreurs, formulaire, tokens, redirection).",
            "Développement d’une modale d’upload : interface, validation, interaction avec l’API.",
            "Manipulation avancée du DOM et du JavaScript moderne."
        ],
        "résultats": [
            "Une page dynamique affichant les travaux de l’architecte depuis l’API.",
            "Une page de connexion complète et sécurisée pour l’administrateur du site.",
            "Une modale fonctionnelle permettant l’ajout de nouveaux médias au portfolio.",
            "Une interface respectant fidèlement la maquette Figma (mise en forme, responsive, interactions)."
        ],
        "améliorations": [
            "Prévoir un système de drag & drop pour organiser les médias.",
            "Mettre en place des tests unitaires ou fonctionnels pour fiabiliser l’application.",
            "Optimiser les performances (compression images, lazy loading)."
        ],
        "dépôtGithub": "https://github.com/kev6711/Projet6_portfolio_architecte_sophie_bluel.git"
    },
    {
        "id": "3",
        "title": "Nina Carducci",
        "cover": "images/compressed/nina_carducci_1.webp",
        "description": "Optimisation complète d'un site : performances, accessibilité, SEO et visibilité locale",
        "contexte": "En tant que développeur freelance, j’observe que le site de Nina Carducci, photographe professionnelle, présente des problèmes majeurs de performance et de référencement. Après un audit initial, Nina me confie une mission complète d’optimisation technique, SEO, accessibilité et performances pour améliorer sa visibilité en ligne, attirer plus de clients et réduire le temps de chargement actuel de son site.",
        "objectifs": [
            "Améliorer les performances globales du site (temps de chargement, poids des images, code).",
            "Optimiser le référencement naturel (SEO) on-page.",
            "Mettre en place un référencement local via Schema.org pour la visibilité sur Bordeaux.",
            "Ajouter les meta-tags sociaux (Open Graph, Twitter Cards) pour les partages.",
            "Corriger les problèmes d’accessibilité identifiés (Wave, bonnes pratiques ARIA).",
            "Produire un rapport Lighthouse avant/après améliorations."
        ],
        "stack": [
            "Schema.org",
            "Open Graph",
            "Twitter Cards",
            "Lighthouse",
            "Wave",
            "Github"
        ],
        "compétences": [
            "Réaliser et interpréter un audit complet Lighthouse et Wave.",
            "Maîtriser les optimisations techniques : lazy loading, compression, minification, DOM allégé, réduction des scripts.",
            "Implémenter un référencement local structuré via Schema.org.",
            "Améliorer l’accessibilité : contraste, structure ARIA, navigation clavier, textes alternatifs.",
            "Rédiger un rapport professionnel clair et orienté client."
        ],
        "résultats": [
            "Amélioration du score de performance Lighthouse de 65 à 100.",
            "Augmentation du score d'accessibilité Lighthouse de 71 à 100.",
            "Passage du score de SEO Lighthouse de 55 à 100.",
            "Poids des images réduit de 98,73%.",
            "Mise en place d’un référencement local permettant d’apparaître dans les résultats géolocalisés.",
            "Etablissement d'un rapport d’optimisation professionnel."
        ],
        "améliorations": [
            "Ajouter plus de contenu SEO en lien avec l’activité (articles/blog, portfolio détaillé).",
            "Suivi régulier des performances (trimestriel) pour maintenir les scores Lighthouse.",
            "Implémenter un système de cache plus efficace.",
            "Ajouter un système de génération automatique d’images optimisées."
        ],
        "dépôtGithub": "https://github.com/kev6711/Projet8_nina_carducci_seo.git",
        "githubPages": "https://kev6711.github.io/Projet8_nina_carducci_seo/"
    },
    {
        "id": "4",
        "title": "ArgentBank",
        "cover": "images/compressed/argentbank_1_mobile.webp",
        "description": "Dashboard React/Redux avec authentification sécurisée et conception d’API transactions",
        "contexte": "Argent Bank, une nouvelle banque en ligne veut se faire une place sur un marché très concurrentiel. L’enjeu immédiat est de mettre en place le tableau de bord utilisateur avec un système d’authentification fiable, sécurisé et évolutif, tout en respectant des délais serrés. Parallèlement, l’équipe prépare déjà la phase 2 autour des transactions, pour laquelle on me demande aussi un avis de conception d’API (modélisation des routes côté back-end, via Swagger).",
        "objectifs": [
            "Développer une application web complète et responsive en React à partir des maquettes.",
            "Permettre à l’utilisateur de visiter la page d'accueil, se connecter et se déconnecter de son profil, modifier son pseudo.",
            "Centraliser l’état global avec Redux pour préparer la future gestion des transactions.",
            "Respecter les bonnes pratiques de Green Code : images optimisées, composants réutilisables.",
            "Concevoir une proposition de routes API pour la gestion des transactions dans un document Swagger en YAML."
        ],
        "stack": ["React", "Redux", "API", "Swagger", "Github"],
        "compétences": [
            "Mise en place d’une authentification utilisateur dans une SPA React (login, logout, routes protégées, gestion des erreurs).",
            "Utilisation de Redux pour gérer l’état global de l’application (auth, profil, future extension aux transactions).",
            "Application de bonnes pratiques de Green Code : optimisation des assets, réduction du code redondant, composants réutilisables.",
            "Lecture et exploitation d’une documentation Swagger pour consommer une API.",
            "Conception d'API et spécification technique Swagger YAML claire pour dialoguer avec l’équipe back-end."
        ],
        "résultats": [
            "Une application React + Redux fonctionnelle et responsive pour la phase 1.",
            "Un state global propre et extensible pour la future gestion des transactions.",
            "Un front respectant les bonnes pratiques de performances (images allégées, composants réutilisables).",
            "Un document Swagger YAML décrivant les endpoints.",
            "Mise en place d’un référencement local permettant d’apparaître dans les résultats géolocalisés.",
            "Etablissement d'un rapport d’optimisation professionnel "
        ],
        "améliorations": [
            "Ajouter des tests unitaires et d’intégration (Jest, React Testing Library) sur les flux critiques (authentification, profil).",
            "Affiner la logique de Green Code : monitoring des performances, audit Lighthouse, réduction des re-renders.",
            "Améliorer l’expérience utilisateur du futur module de transactions (filtres, tri, pagination).",
            "Ajouter un système de génération automatique d’images optimisées."
        ],
        "dépôtGithub": "https://github.com/kev6711/Projet10_argent_bank.git",
        "githubPages": ""
    }
]
